_posts/2019-04-07-sicp-chapter-1.html
---
layout: page
title: SICP Chapter 1 Exercises & Solutions
category: note
tags: 
- post
- SICP
- solutions
---
<style>
.outline-text-3 > p.verse {
    background-color: #eee8d5;
    font: italic 400 1.0em Calibri,-apple-system,BlinkMacSystemFont,"Segoe UI",Helvetica,Arial,sans-serif,"Apple Color Emoji","Segoe UI Emoji","Segoe UI Symbol" !important;
    padding: 1em;
    padding-left: 1.5em;
    border-left: 3px solid #2aa198;
}
</style>

<section id="outline-container-orgd3540a4" class="outline-2">
<h2 id="orgd3540a4"></h2>
<div class="outline-text-2" id="text-orgd3540a4">
<p>
The HTML for this page has been automatically generated by parsing the loosely
formatted source code &amp; comments included in my solutions repository
(<a href="https://github.com/zv/SICP-guile">https://github.com/zv/SICP-guile</a>), if you encounter any unformatted
solutions, you think you've spotted an error or you have something you'd like
to share about the exercises, don't hesitate to leave a comment below
(or a pull request on the source repo).
</p>
</div>
</section>

<section id="outline-container-orgb00ec7a" class="outline-2">
<h2 id="orgb00ec7a">Exercises Chapter 1</h2>
<div class="outline-text-2" id="text-orgb00ec7a">
</div>
<div id="outline-container-orgc78c0a4" class="outline-3">
<h3 id="orgc78c0a4">1.1</h3>
<div class="outline-text-3" id="text-orgc78c0a4">
<p class="verse">
Below is a sequence of expressions. What is the result printed by the<br>
interpreter in response to each expression? Assume that the sequence is to be<br>
evaluated in the order in which it is presented.<br>
<br>
(Expressions Contained in Answer Section)<br>
</p>
</div>

<div id="outline-container-orged30376" class="outline-4">
<h4 id="orged30376">Answer</h4>
<div class="outline-text-4" id="text-orged30376">
<blockquote>
<p>
Respectively:
</p>

<p>
10
scheme@(guile-user)&gt; 10
</p>

<p>
(+ 5 3 4)
scheme@(guile-user)&gt; 12
</p>

<p>
(- 9 1)
scheme@(guile-user)&gt; 8
</p>

<p>
(/ 6 2)
scheme@(guile-user)&gt; 3
</p>

<p>
(+ (* 2 4) (- 4 6))
scheme@(guile-user)&gt; 6
</p>

<p>
(define a 3)
(define b (+ a 1))
(+ a b (* a b))
scheme@(guile-user)&gt; 19
</p>

<p>
(= a b)
scheme@(guile-user)&gt; #f
</p>

<p>
(if (and (&gt; b a) (&lt; b (* a b)))
    b
    a)
scheme@(guile-user)&gt; 4
</p>

<p>
(cond ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))
scheme@(guile-user)&gt; 16
</p>

<p>
(+ 2 (if (&gt; b a) b a))
scheme@(guile-user)&gt; 6
</p>

<p>
(* (cond ((&gt; a b) a)
         ((&lt; a b) b)
         (else -1))
   (+ a 1))
scheme@(guile-user)&gt; 16
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org85064fe" class="outline-3">
<h3 id="org85064fe">1.2</h3>
<div class="outline-text-3" id="text-org85064fe">
<p class="verse">
Translate the following expression into prefix form.<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;5 + 4 + (2 - (3 - (6 + 4/5)))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;------------------------&#x2013;&#x2014;<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;3(6 - 2)(2 - 7)<br>
</p>
</div>

<div id="outline-container-orgbb5f2eb" class="outline-4">
<h4 id="orgbb5f2eb">Answer</h4>
<div class="outline-text-4" id="text-orgbb5f2eb">
<p class="verse">
(/ (+ (+ 5 4) (- 2 (- 3 (+ 6 (/ 4 5))))) (* 3 (- 6 2) (- 2 7)))<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org8777e09" class="outline-3">
<h3 id="org8777e09">1.3</h3>
<div class="outline-text-3" id="text-org8777e09">
<p class="verse">
Define a procedure that takes three numbers as arguments and returns the sum of<br>
the squares of the two larger numbers.<br>
</p>
</div>

<div id="outline-container-orga4c57ab" class="outline-4">
<h4 id="orga4c57ab">Answer</h4>
<div class="outline-text-4" id="text-orga4c57ab">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">largest-squares</span> x y z<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>+
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>&gt; x y<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>square x<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>square y<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>&gt; y z<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>square y<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>square z<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org01409f8" class="outline-3">
<h3 id="org01409f8">1.4</h3>
<div class="outline-text-3" id="text-org01409f8">
<p class="verse">
Observe that our model of evaluation allows for combinations whose operators are<br>
compound expressions. Use this observation to describe the behavior of the<br>
following procedure:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (a-plus-abs-b a b)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;((if (&gt; b 0) + -) a b))<br>
</p>
</div>

<div id="outline-container-org3f7b580" class="outline-4">
<h4 id="org3f7b580">Answer</h4>
<div class="outline-text-4" id="text-org3f7b580">
<blockquote>
<p>
If b is greater than 0, add a to b.
Otherwise, subtract b from a
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org8eedc0a" class="outline-3">
<h3 id="org8eedc0a">1.5</h3>
<div class="outline-text-3" id="text-org8eedc0a">
<p class="verse">
Ben Bitdiddle has invented a test to determine whether the interpreter he is<br>
faced with is using applicative-order evaluation or normal-order evaluation. He<br>
defines the following two procedures:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (p) (p))<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (test x y)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(if (= x 0)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;0<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;y))<br>
<br>
Then he evaluates the expression<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(test 0 (p))<br>
<br>
What behavior will Ben observe with an interpreter that uses applicative-order<br>
evaluation? What behavior will he observe with an interpreter that uses<br>
normal-order evaluation? Explain your answer. (Assume that the evaluation rule<br>
for the special form `if' is the same whether the interpreter is using normal or<br>
applicative order: The predicate expression is evaluated first, and the result<br>
determines whether to evaluate the consequent or the alternative expression.)<br>
</p>
</div>

<div id="outline-container-org9da1dc5" class="outline-4">
<h4 id="org9da1dc5">Answer</h4>
<div class="outline-text-4" id="text-org9da1dc5">
<p class="verse">
An applicative order evaluator would never terminate. The value of `p' is<br>
expanded prior to the logic of `test' being applied.<br>
<br>
Conversely, a normal-order evaluator would return 0, it never had the chance to<br>
expand `p'<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org6ee9d40" class="outline-3">
<h3 id="org6ee9d40">1.6</h3>
<div class="outline-text-3" id="text-org6ee9d40">
<p class="verse">
Alyssa P. Hacker doesn't see why `if' needs to be provided as a special form.<br>
"Why can't I just define it as an ordinary procedure in terms of `cond'?" she<br>
asks. Alyssa's friend Eva Lu Ator claims this can indeed be done, and she<br>
defines a new version of `if':<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (new-if predicate then-clause else-clause)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(cond (predicate then-clause)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(else else-clause)))<br>
<br>
Eva demonstrates the program for Alyssa:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(new-if (= 2 3) 0 5)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;5<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(new-if (= 1 1) 0 5)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;0<br>
<br>
Delighted, Alyssa uses `new-if' to rewrite the square-root program:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (sqrt-iter guess x)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(new-if (good-enough? guess x)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;guess<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(sqrt-iter (improve guess x)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;x)))<br>
<br>
What happens when Alyssa attempts to use this to compute square<br>
roots?  Explain.<br>
</p>
</div>

<div id="outline-container-orgae412ad" class="outline-4">
<h4 id="orgae412ad">Answer</h4>
<div class="outline-text-4" id="text-orgae412ad">
<blockquote>
<p>
Any function supplied to `new-if' will be applied, `sqrt-iter' will thus infinitely loop.
</p>
</blockquote>
</div>
</div>
</div>
