_posts/2019-04-07-sicp-chapter-1.html
<div id="outline-container-orgee1ccae" class="outline-3">
<h3 id="orgee1ccae">1.7</h3>
<div class="outline-text-3" id="text-orgee1ccae">
<p class="verse">
The `good-enough?' test used in computing square roots will not be very<br>
effective for finding the square roots of very small numbers. Also, in real<br>
computers, arithmetic operations are almost always performed with limited<br>
precision. This makes our test inadequate for very large numbers. Explain these<br>
statements, with quotes showing how the test fails for small and large<br>
numbers.<br>
<br>
An alternative strategy for implementing `good-enough?' is to watch how<br>
`guess' changes from one iteration to the next and to stop when the change<br>
is a very small fraction of the guess. Design a square-root procedure that<br>
uses this kind of end test. Does this work better for small and large<br>
numbers?<br>
</p>
</div>

<div id="outline-container-orgb32383d" class="outline-4">
<h4 id="orgb32383d">Answer</h4>
<div class="outline-text-4" id="text-orgb32383d">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">fix/sqrt-iter</span> guess last-guess x<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>good-enough? <span style="color: #859900;">(</span>&lt; <span style="color: #b58900;">(</span>abs <span style="color: #268bd2;">(</span>- guess last-guess<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #6c71c4;">0.001</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">[</span>next-guess <span style="color: #859900;">(</span>average guess <span style="color: #b58900;">(</span>/ x guess<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> good-enough? guess
        <span style="color: #6c71c4;">(</span>fix/sqrt-iter next-guess guess x<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc514cf3" class="outline-3">
<h3 id="orgc514cf3">1.8</h3>
<div class="outline-text-3" id="text-orgc514cf3">
<p class="verse">
Newton's method for cube roots is based on the fact that if y is an<br>
approximation to the cube root of x, then a better approximation is given<br>
by the value<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;x/y<sup>2</sup> + 2y<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;-----&#x2013;&#x2014;<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;3<br>
<br>
Use this formula to implement a cube-root procedure analogous to the<br>
square-root procedure. (In section 1.3.4 we will see how to implement<br>
Newton's method in general as an abstraction of these square-root and<br>
cube-root procedures.)<br>
</p>
</div>

<div id="outline-container-org6675bbe" class="outline-4">
<h4 id="org6675bbe">Answer</h4>
<div class="outline-text-4" id="text-org6675bbe">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.8/sqrt-iter</span> guess last-guess x<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>good-enough? <span style="color: #859900;">(</span>&lt; <span style="color: #b58900;">(</span>abs <span style="color: #268bd2;">(</span>- guess last-guess<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #6c71c4;">0.001</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">[</span>next-guess <span style="color: #859900;">(</span>/ <span style="color: #b58900;">(</span>+ <span style="color: #268bd2;">(</span>/ x <span style="color: #6c71c4;">(</span>square guess<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
                       <span style="color: #268bd2;">(</span>* <span style="color: #6c71c4;">2</span> guess<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
                    <span style="color: #6c71c4;">3</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> good-enough? guess
        <span style="color: #6c71c4;">(</span>fix/sqrt-iter next-guess guess x<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga43b6e5" class="outline-3">
<h3 id="orga43b6e5">1.9</h3>
<div class="outline-text-3" id="text-orga43b6e5">
<p class="verse">
Each of the following two procedures defines a method for adding two<br>
positive integers in terms of the procedures `inc', which increments its<br>
argument by 1, and `dec', which decrements its argument by 1.<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (+ a b)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(if (= a 0)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;b<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(inc (+ (dec a) b))))<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (+ a b)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(if (= a 0)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;b<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(+ (dec a) (inc b))))<br>
<br>
Using the substitution model, illustrate the process generated by each<br>
procedure in evaluating `(+ 4 5)'. Are these processes iterative or<br>
recursive?<br>
</p>
</div>

<div id="outline-container-org0e76be0" class="outline-4">
<h4 id="org0e76be0">Answer</h4>
<div class="outline-text-4" id="text-org0e76be0">
<p class="verse">
<br>
The first is recursive:<br>
<br>
&#xa0;&#xa0;scheme@(guile-user)&gt; ,trace (+ 4 5)<br>
<br>
&#xa0;&#xa0;trace: |  (+ 4 5)<br>
&#xa0;&#xa0;trace: |  |  (+ 3 5)<br>
&#xa0;&#xa0;trace: |  |  |  (+ 2 5)<br>
&#xa0;&#xa0;trace: |  |  |  |  (+ 1 5)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  (+ 0 5)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  5<br>
&#xa0;&#xa0;trace: |  |  |  |  6<br>
&#xa0;&#xa0;trace: |  |  |  7<br>
&#xa0;&#xa0;trace: |  |  8<br>
&#xa0;&#xa0;trace: |  9<br>
<br>
The second function is iterative<br>
<br>
&#xa0;&#xa0;scheme@(guile-user)&gt; ,trace (pl 4 5)<br>
&#xa0;&#xa0;trace: |  (pl 4 5)<br>
&#xa0;&#xa0;trace: |  |  (dec 4)<br>
&#xa0;&#xa0;trace: |  |  3<br>
&#xa0;&#xa0;trace: |  |  (inc 5)<br>
&#xa0;&#xa0;trace: |  |  6<br>
&#xa0;&#xa0;trace: |  (pl 3 6)<br>
&#xa0;&#xa0;trace: |  |  (dec 3)<br>
&#xa0;&#xa0;trace: |  |  2<br>
&#xa0;&#xa0;trace: |  |  (inc 6)<br>
&#xa0;&#xa0;trace: |  |  7<br>
&#xa0;&#xa0;trace: |  (pl 2 7)<br>
&#xa0;&#xa0;trace: |  |  (dec 2)<br>
<br>
&#xa0;&#xa0;trace: |  |  1<br>
&#xa0;&#xa0;trace: |  |  (inc 7)<br>
&#xa0;&#xa0;trace: |  |  8<br>
&#xa0;&#xa0;trace: |  (pl 1 8)<br>
&#xa0;&#xa0;trace: |  |  (dec 1)<br>
&#xa0;&#xa0;trace: |  |  0<br>
&#xa0;&#xa0;trace: |  |  (inc 8)<br>
&#xa0;&#xa0;trace: |  |  9<br>
&#xa0;&#xa0;trace: |  (pl 0 9)<br>
&#xa0;&#xa0;trace: |  9<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org816045d" class="outline-3">
<h3 id="org816045d">1.10</h3>
<div class="outline-text-3" id="text-org816045d">
<p class="verse">
The following procedure computes a mathematical function called Ackermann's<br>
function.<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (A x y)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(cond ((= y 0) 0)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;((= x 0) (* 2 y))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;((= y 1) 2)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(else (A (- x 1)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(A x (- y 1))))))<br>
<br>
What are the values of the following expressions?<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(A 1 10)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(A 2 4)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(A 3 3)<br>
<br>
Consider the following procedures, where A is the procedure defined above:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (f n) (A 0 n))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (g n) (A 1 n))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (h n) (A 2 n))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (k n) (* 5 n n))<br>
<br>
Give concise mathematical definitions for the functions computed by the<br>
procedures f, g, and h for positive integer values of n. For quote, (k n)<br>
computes 5n<sup>2</sup>.<br>
</p>
</div>
