_posts/2019-04-07-sicp-chapter-1.html

<div id="outline-container-orgb2d1cee" class="outline-4">
<h4 id="orgb2d1cee">Answer</h4>
<div class="outline-text-4" id="text-orgb2d1cee">
<p class="verse">
<br>
A trace of the first Ackermann function shown produces a long list of<br>
recursive calls, which is only exaggerated as `x' increases.<br>
<br>
&#xa0;&#xa0;scheme@(guile-user)&gt; ,trace (A 1 10)<br>
&#xa0;&#xa0;trace: |  (A 1 10)<br>
&#xa0;&#xa0;trace: |  |  (A 1 9)<br>
&#xa0;&#xa0;trace: |  |  |  (A 1 8)<br>
&#xa0;&#xa0;trace: |  |  |  |  (A 1 7)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  (A 1 6)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  (A 1 5)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  (A 1 4)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  |  (A 1 3)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  |  |  (A 1 2)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  |  |  |  (A 1 1)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  |  |  |  2<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  |  |  (A 0 2)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  |  |  4<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  |  (A 0 4)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  |  8<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  (A 0 8)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  |  16<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  (A 0 16)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  |  32<br>
&#xa0;&#xa0;trace: |  |  |  |  |  (A 0 32)<br>
&#xa0;&#xa0;trace: |  |  |  |  |  64<br>
&#xa0;&#xa0;trace: |  |  |  |  (A 0 64)<br>
&#xa0;&#xa0;trace: |  |  |  |  128<br>
&#xa0;&#xa0;trace: |  |  |  (A 0 128)<br>
&#xa0;&#xa0;trace: |  |  |  256<br>
&#xa0;&#xa0;trace: |  |  (A 0 256)<br>
&#xa0;&#xa0;trace: |  |  512<br>
&#xa0;&#xa0;trace: |  (A 0 512)<br>
&#xa0;&#xa0;trace: |  1024<br>
&#xa0;&#xa0;scheme@(guile-user)&gt; (A 2 4)<br>
&#xa0;&#xa0;$2 = 65536<br>
&#xa0;&#xa0;scheme@(guile-user)&gt; (A 3 3)<br>
&#xa0;&#xa0;$3 = 65536<br>
<br>
<br>
The functions described can be simplified as follows:<br>
<br>
&#xa0;&#xa0;(define (f n) (A 0 n))<br>
&#xa0;&#xa0;→  2n<br>
<br>
&#xa0;&#xa0;(define (g n) (A 1 n))<br>
&#xa0;&#xa0;→  n²<br>
<br>
&#xa0;&#xa0;(define (h n) (A 2 n))<br>
&#xa0;&#xa0;→  2↑n<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org1550ce5" class="outline-3">
<h3 id="org1550ce5">1.11</h3>
<div class="outline-text-3" id="text-org1550ce5">
<p class="verse">
A function f is defined by the rule that<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;f(n) = n if n &lt; 3<br>
<br>
and<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;f(n) = f(n - 1) + 2f(n - 2) + 3f(n - 3) if n &gt;= 3.<br>
<br>
Write a procedure that computes f by means of a recursive process.<br>
Write a procedure that computes f by means of an iterative process.<br>
</p>
</div>

<div id="outline-container-orgc87b172" class="outline-4">
<h4 id="orgc87b172">Answer</h4>
<div class="outline-text-4" id="text-orgc87b172">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">rule1.11/recursive</span> n<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>&lt; n <span style="color: #6c71c4;">3</span><span style="color: #268bd2;">)</span> n
      <span style="color: #268bd2;">(</span>+ <span style="color: #6c71c4;">(</span>rule1.11/recursive <span style="color: #859900;">(</span>- n <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>* <span style="color: #6c71c4;">2</span> <span style="color: #859900;">(</span>rule1.11/recursive <span style="color: #b58900;">(</span>- n <span style="color: #6c71c4;">2</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>* <span style="color: #6c71c4;">3</span> <span style="color: #859900;">(</span>rule1.11/recursive <span style="color: #b58900;">(</span>- n <span style="color: #6c71c4;">3</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">rule1.11/iterative</span> n<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">driver</span> count a b c<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>= count n<span style="color: #6c71c4;">)</span> c
        <span style="color: #6c71c4;">(</span>driver <span style="color: #859900;">(</span>+ count <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span>
                       <span style="color: #859900;">(</span>+ a <span style="color: #b58900;">(</span>* <span style="color: #6c71c4;">2</span> b<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>* <span style="color: #6c71c4;">3</span> c<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
                       a
                       b<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>driver <span style="color: #6c71c4;">0</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga6c0651" class="outline-3">
<h3 id="orga6c0651">1.12</h3>
<div class="outline-text-3" id="text-orga6c0651">
<p class="verse">
The following pattern of numbers is called "Pascal's triangle".<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;1<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;1   1<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;1   2   1<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;1   3   3   1<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;1   4   6   4   1<br>
<br>
The numbers at the edge of the triangle are all 1, and each number inside<br>
the triangle is the sum of the two numbers above it. Write a procedure that<br>
computes elements of Pascal's triangle by means of a recursive process.<br>
</p>
</div>

<div id="outline-container-org6cd3eb5" class="outline-4">
<h4 id="org6cd3eb5">Answer</h4>
<div class="outline-text-4" id="text-org6cd3eb5">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">pascals-triangle</span> depth<span style="color: #b58900;">)</span>
  <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">`build-entry' doesn't memoize the finding of each number. You could do</span>
  <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">so either here or with more changes to `build-row'.</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">build-entry</span> rows col<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #b58900;">(</span>= rows <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>= col <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span> <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">or</span> <span style="color: #b58900;">(</span>&lt; col <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>&lt; rows col<span style="color: #b58900;">)</span><span style="color: #859900;">)</span> <span style="color: #6c71c4;">0</span><span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900;">(</span>+ <span style="color: #b58900;">(</span>build-entry <span style="color: #268bd2;">(</span>- rows <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>- col <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
              <span style="color: #b58900;">(</span>build-entry <span style="color: #268bd2;">(</span>- rows <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span> col<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">build-row</span> ctr length<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>= ctr <span style="color: #859900;">(</span>1+ length<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span> '<span style="color: #6c71c4;">()</span>
        <span style="color: #6c71c4;">(</span>cons <span style="color: #859900;">(</span>build-entry length ctr<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>build-row <span style="color: #b58900;">(</span>+ ctr <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span> length<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">build</span> n<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>= n depth<span style="color: #6c71c4;">)</span> '<span style="color: #6c71c4;">()</span>
        <span style="color: #6c71c4;">(</span>cons <span style="color: #859900;">(</span>build-row <span style="color: #6c71c4;">0</span> n<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>build <span style="color: #b58900;">(</span>1+ n<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span>build <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
