_posts/2019-04-07-sicp-chapter-1.html
<div id="outline-container-org75e3531" class="outline-3">
<h3 id="org75e3531">1.13</h3>
<div class="outline-text-3" id="text-org75e3531">
</div>
<div id="outline-container-org04f4898" class="outline-4">
<h4 id="org04f4898">Answer</h4>
</div>
</div>
<div id="outline-container-org484260b" class="outline-3">
<h3 id="org484260b">1.14</h3>
<div class="outline-text-3" id="text-org484260b">
<p class="verse">
Draw the tree illustrating the process generated by the `count-change'<br>
procedure of section *Note 1.2.2 in making change for 11 cents. What are<br>
the orders of growth of the space and number of steps used by this process<br>
as the amount to be changed increases?<br>
</p>
</div>

<div id="outline-container-org9a21826" class="outline-4">
<h4 id="org9a21826">Answer</h4>
<div class="outline-text-4" id="text-org9a21826">
<p class="verse">
trace: (count-change 11)<br>
trace: (cc 11 5)<br>
trace: |  (cc 11 4)<br>
trace: |  |  (cc 11 3)<br>
trace: |  |  |  (cc 11 2)<br>
trace: |  |  |  |  (cc 11 1)<br>
trace: |  |  |  |  |  (cc 11 0)<br>
trace: |  |  |  |  |  0<br>
trace: |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  1<br>
trace: |  |  |  |  |  (cc 10 1)<br>
trace: |  |  |  |  |  |  (cc 10 0)<br>
trace: |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  (cc 9 1)<br>
trace: |  |  |  |  |  |  |  (cc 9 0)<br>
trace: |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  (cc 8 1)<br>
trace: |  |  |  |  |  |  |  |  (cc 8 0)<br>
trace: |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  (cc 7 1)<br>
trace: |  |  |  |  |  |  |  |  |  (cc 7 0)<br>
trace: |  |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  (cc 6 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  (cc 6 0)<br>
trace: |  |  |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  (cc 5 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  (cc 5 0)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  (cc 4 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  (cc 4 0)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  (cc 3 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  (cc 3 0)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  (cc 2 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  15&gt; (cc 2 0)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  15&lt; 0<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  15&gt; (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  15&lt; 1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  15&gt; (cc 1 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  16&gt; (cc 1 0)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  16&lt; 0<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  16&gt; (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  16&lt; 1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  16&gt; (cc 0 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  16&lt; 1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  15&lt; 1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  1<br>
trace: |  |  |  |  1<br>
trace: |  |  |  |  (first-denomination 2)<br>
trace: |  |  |  |  5<br>
trace: |  |  |  |  (cc 6 2)<br>
trace: |  |  |  |  |  (cc 6 1)<br>
trace: |  |  |  |  |  |  (cc 6 0)<br>
trace: |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  (cc 5 1)<br>
trace: |  |  |  |  |  |  |  (cc 5 0)<br>
trace: |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  (cc 4 1)<br>
trace: |  |  |  |  |  |  |  |  (cc 4 0)<br>
trace: |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  (cc 3 1)<br>
trace: |  |  |  |  |  |  |  |  |  (cc 3 0)<br>
trace: |  |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  (cc 2 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  (cc 2 0)<br>
trace: |  |  |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  (cc 1 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  (cc 1 0)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  |  (cc 0 1)<br>
trace: |  |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  1<br>
trace: |  |  |  |  |  (first-denomination 2)<br>
trace: |  |  |  |  |  5<br>
trace: |  |  |  |  |  (cc 1 2)<br>
trace: |  |  |  |  |  |  (cc 1 1)<br>
trace: |  |  |  |  |  |  |  (cc 1 0)<br>
trace: |  |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  |  (cc 0 1)<br>
trace: |  |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  (first-denomination 2)<br>
trace: |  |  |  |  |  |  5<br>
trace: |  |  |  |  |  |  (cc -4 2)<br>
trace: |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  1<br>
trace: |  |  |  |  2<br>
trace: |  |  |  3<br>
trace: |  |  |  (first-denomination 3)<br>
trace: |  |  |  10<br>
trace: |  |  |  (cc 1 3)<br>
trace: |  |  |  |  (cc 1 2)<br>
trace: |  |  |  |  |  (cc 1 1)<br>
trace: |  |  |  |  |  |  (cc 1 0)<br>
trace: |  |  |  |  |  |  0<br>
trace: |  |  |  |  |  |  (first-denomination 1)<br>
trace: |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  |  (cc 0 1)<br>
trace: |  |  |  |  |  |  1<br>
trace: |  |  |  |  |  1<br>
trace: |  |  |  |  |  (first-denomination 2)<br>
trace: |  |  |  |  |  5<br>
trace: |  |  |  |  |  (cc -4 2)<br>
trace: |  |  |  |  |  0<br>
trace: |  |  |  |  1<br>
trace: |  |  |  |  (first-denomination 3)<br>
trace: |  |  |  |  10<br>
trace: |  |  |  |  (cc -9 3)<br>
trace: |  |  |  |  0<br>
trace: |  |  |  1<br>
trace: |  |  4<br>
trace: |  |  (first-denomination 4)<br>
trace: |  |  25<br>
trace: |  |  (cc -14 4)<br>
trace: |  |  0<br>
trace: |  4<br>
trace: |  (first-denomination 5)<br>
trace: |  50<br>
trace: |  (cc -39 5)<br>
trace: |  0<br>
trace: 4<br>
</p>
</div>
</div>
</div>
