_posts/2019-04-07-sicp-chapter-1.html
<div id="outline-container-orgd7bf083" class="outline-3">
<h3 id="orgd7bf083">1.15</h3>
<div class="outline-text-3" id="text-orgd7bf083">
<p class="verse">
The sine of an angle (specified in radians) can be computed by making use<br>
of the approximation `sin' xapprox x if x is sufficiently small, and the<br>
trigonometric identity<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;x             x<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;sin x = 3 sin &#x2014; - 4 sin<sup>3</sup> &#x2014;<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;3             3<br>
<br>
to reduce the size of the argument of `sin'. (For purposes of this<br>
exercise an angle is considered "sufficiently small" if its magnitude is<br>
not greater than 0.1 radians.) These ideas are incorporated in the<br>
following procedures:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (cube x) (* x x x))<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (p x) (- (* 3 x) (* 4 (cube x))))<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (sine angle)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(if (not (&gt; (abs angle) 0.1))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;angle<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(p (sine (/ angle 3.0)))))<br>
<br>
a. How many times is the procedure `p' applied when `(sine 12.15)' is<br>
evaluated?<br>
<br>
b. What is the order of growth in space and number of steps (as a function<br>
of a) used by the process generated by the `sine' procedure when `(sine a)'<br>
is evaluated?<br>
</p>
</div>

<div id="outline-container-org8b22571" class="outline-4">
<h4 id="org8b22571">Answer</h4>
<div class="outline-text-4" id="text-org8b22571">
<blockquote>
<p>
a. The procedure is evaluated 5 times
b. The order of growth is O(log(n))
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org4cdca19" class="outline-3">
<h3 id="org4cdca19">1.16</h3>
<div class="outline-text-3" id="text-org4cdca19">
<p class="verse">
Design a procedure that evolves an iterative exponentiation process that<br>
uses successive squaring and uses a logarithmic number of steps, as does<br>
`fast-expt'.<br>
<br>
(Hint: Using the observation that (bⁿ/²)²= (b²)ⁿ/², keep, along with the<br>
exponent `n' and the base `b', an additional state variable `a', and define<br>
the state transformation in such a way that the product abⁿ is unchanged<br>
from state to state. At the beginning of the process a is taken to be 1,<br>
and the answer is given by the value of `a' at the end of the process. In<br>
general, the technique of defining an "invariant quantity" that remains<br>
unchanged from state to state is a powerful way to think about the design<br>
of iterative algorithms.)<br>
</p>
</div>

<div id="outline-container-orgf202a2b" class="outline-4">
<h4 id="orgf202a2b">Answer</h4>
<div class="outline-text-4" id="text-orgf202a2b">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">zv/expt-iter</span> b n a<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
   <span style="color: #268bd2;">[</span><span style="color: #6c71c4;">(</span>= n <span style="color: #6c71c4;">0</span><span style="color: #6c71c4;">)</span> a<span style="color: #268bd2;">]</span>
   <span style="color: #268bd2;">[</span><span style="color: #6c71c4;">(</span>even? n<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>zv/expt-iter <span style="color: #859900;">(</span>* b b<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>/ n <span style="color: #6c71c4;">2</span><span style="color: #859900;">)</span> a<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
   <span style="color: #268bd2;">[</span><span style="color: #859900; font-weight: bold;">else</span>      <span style="color: #6c71c4;">(</span>zv/expt-iter  b <span style="color: #859900;">(</span>- n <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span> <span style="color: #859900;">(</span>* a b<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf5492cf" class="outline-3">
<h3 id="orgf5492cf">1.17</h3>
<div class="outline-text-3" id="text-orgf5492cf">
<p class="verse">
The exponentiation algorithms in this section are based on performing<br>
exponentiation by means of repeated multiplication. In a similar way, one<br>
can perform integer multiplication by means of repeated addition. The<br>
following multiplication procedure (in which it is assumed that our<br>
language can only add, not multiply) is analogous to the `expt' procedure:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (* a b)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(if (= b 0)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;0<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(+ a (* a (- b 1)))))<br>
<br>
This algorithm takes a number of steps that is linear in `b'. Now suppose<br>
we include, together with addition, operations `double', which doubles an<br>
integer, and `halve', which divides an (even) integer by 2. Using these,<br>
design a multiplication procedure analogous to `fast-expt' that uses a<br>
logarithmic number of steps.<br>
</p>
</div>

<div id="outline-container-org72b5f1e" class="outline-4">
<h4 id="org72b5f1e">Answer</h4>
<div class="outline-text-4" id="text-org72b5f1e">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.17/fast-*</span> a b<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">double</span> x<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>+ x x<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">halve</span> x<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>/ x <span style="color: #6c71c4;">2</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>= b <span style="color: #6c71c4;">0</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>even? b<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>double <span style="color: #859900;">(</span>* a <span style="color: #b58900;">(</span>halve b<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #6c71c4;">(</span>+ a <span style="color: #859900;">(</span>* a <span style="color: #b58900;">(</span>- b <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9fa3e32" class="outline-3">
<h3 id="org9fa3e32">1.18</h3>
<div class="outline-text-3" id="text-org9fa3e32">
</div>
<div id="outline-container-org0e21dee" class="outline-4">
<h4 id="org0e21dee">Answer</h4>
</div>
</div>
<div id="outline-container-org6787414" class="outline-3">
<h3 id="org6787414">1.19</h3>
<div class="outline-text-3" id="text-org6787414">
<p class="verse">
There is a clever algorithm for computing the Fibonacci numbers in a<br>
logarithmic number of steps. Recall the transformation of the state<br>
variables a and b in the fib-iter process of 1.2.2: a ← a + b and b ← a.<br>
Call this transformation T, and observe that applying T over and over again<br>
n times, starting with 1 and 0, produces the pair Fib(n + 1) and Fib(n) .<br>
In other words, the Fibonacci numbers are produced by applying T n, the<br>
n-th power of the transformation T, starting with the pair (1, 0). Now<br>
consider T to be the special case of p = 0 and q = 1 in a family of<br>
transformations T<sub>pq</sub> , where T<sub>pq</sub> transforms the pair(a, b) according to a<br>
← bq + aq + ap and b ← bp + aq .<br>
<br>
Show that if we apply such a transformation T<sub>pq</sub> twice, the effect is the<br>
same as using a single transformation T<sub>p</sub>′q′ of the same form, and compute<br>
p′ and q′ in terms of p and q .<br>
<br>
This gives us an explicit way to square these transformations, and thus we<br>
can compute T n using successive squaring, as in the fast-expt procedure.<br>
<br>
Put this all together to complete the following procedure, which runs in a<br>
logarithmic number of steps:<br>
</p>
</div>
