_posts/2019-04-07-sicp-chapter-1.html

<div id="outline-container-org177dda0" class="outline-4">
<h4 id="org177dda0">Answer</h4>
<div class="outline-text-4" id="text-org177dda0">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.19/fib</span> n<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>1.19/fib-iter <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">0</span> <span style="color: #6c71c4;">0</span> <span style="color: #6c71c4;">1</span> n<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.19/fib-iter</span> a b p q count<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>= count <span style="color: #6c71c4;">0</span><span style="color: #6c71c4;">)</span> b<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>even? count<span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>1.19/fib-iter a
                   b
                   <span style="color: #859900;">(</span>+ <span style="color: #b58900;">(</span>square p<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>square q<span style="color: #b58900;">)</span><span style="color: #859900;">)</span> <span style="color: #93a1a1;">; </span><span style="color: #93a1a1;">compute p'</span>
                   <span style="color: #859900;">(</span>+ <span style="color: #b58900;">(</span>* <span style="color: #6c71c4;">2</span> p q<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>square q<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>  <span style="color: #93a1a1;">; </span><span style="color: #93a1a1;">compute q'</span>
                   <span style="color: #859900;">(</span>/ count <span style="color: #6c71c4;">2</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #6c71c4;">(</span>1.19/fib-iter <span style="color: #859900;">(</span>+ <span style="color: #b58900;">(</span>* b q<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>* a q<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>* a p<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
                        <span style="color: #859900;">(</span>+ <span style="color: #b58900;">(</span>* b p<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>* a q<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
                        p
                        q
                        <span style="color: #859900;">(</span>- count <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #93a1a1;">;; </span><span style="color: #cc9393;">TODO</span><span style="color: #93a1a1;"> </span><span style="color: #cc9393;">XXX</span><span style="color: #93a1a1;"> write test</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8edc74e" class="outline-3">
<h3 id="org8edc74e">1.20</h3>
<div class="outline-text-3" id="text-org8edc74e">
<p class="verse">
The process that a procedure generates is of course dependent on the rules<br>
used by the interpreter. As an quote, consider the iterative `gcd'<br>
procedure given above. Suppose we were to interpret this procedure using<br>
normal-order evaluation, as discussed in section *Note 1-1-5. (The<br>
normal-order-evaluation rule for `if' is described in *Note Exercise 1-5)<br>
Using the substitution method (for normal order), illustrate the process<br>
generated in evaluating `(gcd 206 40)' and indicate the `remainder'<br>
operations that are actually performed. How many `remainder' operations are<br>
actually performed in the normal-order evaluation of `(gcd 206 40)'? In the<br>
applicative-order evaluation?<br>
</p>
</div>

<div id="outline-container-org5e02738" class="outline-4">
<h4 id="org5e02738">Answer</h4>
<div class="outline-text-4" id="text-org5e02738">
<blockquote>
<p>
Performs 18 `remainder' operations
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org219a962" class="outline-3">
<h3 id="org219a962">1.21</h3>
<div class="outline-text-3" id="text-org219a962">
<p class="verse">
Use the smallest-divisor procedure to find the smallest divisor of each of<br>
the following numbers: 199, 1999, 19999.<br>
</p>
</div>

<div id="outline-container-orgf3fc63a" class="outline-4">
<h4 id="orgf3fc63a">Answer</h4>
<div class="outline-text-4" id="text-orgf3fc63a">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">divides?</span> a b<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>= <span style="color: #268bd2;">(</span>remainder b a<span style="color: #268bd2;">)</span> <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">find-divisor</span> n test-divisor<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>&gt; <span style="color: #859900;">(</span>square test-divisor<span style="color: #859900;">)</span> n<span style="color: #6c71c4;">)</span> n<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>divides? test-divisor n<span style="color: #6c71c4;">)</span> test-divisor<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #6c71c4;">(</span>find-divisor n <span style="color: #859900;">(</span>+ test-divisor <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">smallest-divisor</span> n<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>find-divisor n <span style="color: #6c71c4;">2</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #cc9393;">TODO</span><span style="color: #93a1a1;"> </span><span style="color: #cc9393;">XXX</span><span style="color: #93a1a1;"> write test</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">(format #f "~a" (for-each smallest-divisor '(199 1999 1999)))</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6f7ab1b" class="outline-3">
<h3 id="org6f7ab1b">1.22</h3>
<div class="outline-text-3" id="text-org6f7ab1b">
<p class="verse">
Most Lisp implementations include a primitive called `runtime' that returns<br>
an integer that specifies the amount of time the system has been running<br>
(measured, for quote, in microseconds). The following `timed-prime-test'<br>
procedure, when called with an integer n, prints n and checks to see if n<br>
is prime. If n is prime, the procedure prints three asterisks followed by<br>
the amount of time used in performing the test.<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (timed-prime-test n)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(newline)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(display n)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(start-prime-test n (current-time)))<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (start-prime-test n start-time)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(if (prime? n)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(report-prime (- (current-time) start-time))))<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (report-prime elapsed-time)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(display " <b>*</b> ")<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(display elapsed-time)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;#t)<br>
<br>
Using this procedure, write a procedure `search-for-primes' that<br>
checks the primality of consecutive odd integers in a specified range. Use<br>
your procedure to find the three smallest primes larger than 1000; larger<br>
than 10,000; larger than 100,000; larger than 1,000,000. Note the time<br>
needed to test each prime. Since the testing algorithm has order of growth<br>
of [theta](_[sqrt]<sub>(n)</sub>), you should expect that testing for primes around<br>
10,000 should take about _[sqrt]<sub>(10)</sub> times as long as testing for primes<br>
around 1000. Do your timing data bear this out? How well do the data for<br>
100,000 and 1,000,000 support the _[sqrt]<sub>(n)</sub> prediction? Is your result<br>
compatible with the notion that programs on your machine run in time<br>
proportional to the number of steps required for the computation?<br>
</p>
</div>
