org/_posts/2019-04-07-sicp-chapter-1.org
*** Answer
#+BEGIN_SRC scheme
(define (prime? n)
  (= n (smallest-divisor n)))

(define (expmod base exp m)
  (cond ((= exp 0) 1)
        ((even? exp)
         (remainder
          (square (expmod base (/ exp 2) m))
          m))
        (else
         (remainder
          (* base (expmod base (- exp 1) m))
          m))))

(define (search-for-primes start)
  (define (is-prime? n)
    (cond
     [(even? n) #f]
     [(< n 0) #f]
     [(timed-prime-test n) #t]
     [else (is-prime? (- n 2))]))

  (define (driver n primes count)
    (cond
     [(even? n) (driver (+ n 1) primes count)]
     [(= count 3) primes]
     [(is-prime? n) (driver (+ n 2) (cons n primes) (+ count 1))]
     [else (driver (+ n 2) primes count)]))

  (driver start '() 0))
#+END_SRC
** 1.23
#+BEGIN_VERSE
The `smallest-divisor' procedure shown at the start of this section does
lots of needless testing: After it checks to see if the number is divisible
by 2 there is no point in checking to see if it is divisible by any larger
even numbers. This suggests that the values used for `test-divisor' should
not be 2, 3, 4, 5, 6, ..., but rather 2, 3, 5, 7, 9, .... To implement this
change, define a procedure `next' that returns 3 if its input is equal to 2
and otherwise returns its input plus 2. Modify the `smallest-divisor'
procedure to use `(next test-divisor)' instead of `(+ test-divisor 1)'.
With `timed-prime-test' incorporating this modified version of
`smallest-divisor', run the test for each of the 12 primes found Note in 1.22
Since this modification halves the number of test steps, you should expect
it to run about twice as fast. Is this expectation confirmed? If not, what
is the observed ratio of the speeds of the two algorithms, and how do you
explain the fact that it is different from 2?
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.23/next n) (if (= n 2) 3 (+ n 2)))

#+END_SRC
** 1.24

*** Answer
** 1.25
#+BEGIN_VERSE
Alyssa P. Hacker complains that we went to a lot of extra work in writing
`expmod'. After all, she says, since we already know how to compute
exponentials, we could have simply written

          (define (expmod base exp m)
            (remainder (fast-expt base exp) m))

Is she correct? Would this procedure serve as well for our fast prime
tester? Explain. 
#+END_VERSE

*** Answer
#+BEGIN_QUOTE
Depending on the behavior of large values of `base' and `exp' combined with
the system's handling of large numbers, it is either a middling gain or an
#+END_QUOTE
** 1.26
#+BEGIN_VERSE
Louis Reasoner is having great difficulty doing *Note Exercise 1.24. His
`fast-prime?' test seems to run more slowly than his `prime?' test. Louis
calls his friend Eva Lu Ator over to help. When they examine Louis's code,
they find that he has rewritten the `expmod' procedure to use an explicit
multiplication, rather than calling `square':

          (define (expmod base exp m)
            (cond ((= exp 0) 1)
                  ((even? exp)
                   (remainder (* (expmod base (/ exp 2) m)
                                 (expmod base (/ exp 2) m))
                              m))
                  (else
                   (remainder (* base (expmod base (- exp 1) m))
                              m))))

"I don't see what difference that could make," says Louis. "I do."
says Eva. "By writing the procedure like that, you have transformed the
[theta](`log' n) process into a [theta](n) process." Explain. 
#+END_VERSE

*** Answer
#+BEGIN_QUOTE
Assuming the computer doesn't perform any sort of sophisticated
memoization, effectively each step is performing twice as much work for n
steps, e.g n^2, trimming the speed of the original implementation down to
#+END_QUOTE
** 1.27

*** Answer
** 1.28

*** Answer
