_posts/2019-04-07-sicp-chapter-1.html

<div id="outline-container-orgdf08161" class="outline-4">
<h4 id="orgdf08161">Answer</h4>
<div class="outline-text-4" id="text-orgdf08161">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">prime?</span> n<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>= n <span style="color: #268bd2;">(</span>smallest-divisor n<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">expmod</span> base exp m<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>= exp <span style="color: #6c71c4;">0</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>even? exp<span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>remainder
          <span style="color: #859900;">(</span>square <span style="color: #b58900;">(</span>expmod base <span style="color: #268bd2;">(</span>/ exp <span style="color: #6c71c4;">2</span><span style="color: #268bd2;">)</span> m<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          m<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">else</span>
         <span style="color: #6c71c4;">(</span>remainder
          <span style="color: #859900;">(</span>* base <span style="color: #b58900;">(</span>expmod base <span style="color: #268bd2;">(</span>- exp <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span> m<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          m<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">search-for-primes</span> start<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">is-prime?</span> n<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>even? n<span style="color: #859900;">)</span> #f<span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>&lt; n <span style="color: #6c71c4;">0</span><span style="color: #859900;">)</span> #f<span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>timed-prime-test n<span style="color: #859900;">)</span> #t<span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900;">(</span>is-prime? <span style="color: #b58900;">(</span>- n <span style="color: #6c71c4;">2</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">driver</span> n primes count<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>even? n<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>driver <span style="color: #b58900;">(</span>+ n <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span> primes count<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>= count <span style="color: #6c71c4;">3</span><span style="color: #859900;">)</span> primes<span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>is-prime? n<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>driver <span style="color: #b58900;">(</span>+ n <span style="color: #6c71c4;">2</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>cons n primes<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>+ count <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900;">(</span>driver <span style="color: #b58900;">(</span>+ n <span style="color: #6c71c4;">2</span><span style="color: #b58900;">)</span> primes count<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span>driver start '<span style="color: #268bd2;">()</span> <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org34d9936" class="outline-3">
<h3 id="org34d9936">1.23</h3>
<div class="outline-text-3" id="text-org34d9936">
<p class="verse">
The `smallest-divisor' procedure shown at the start of this section does<br>
lots of needless testing: After it checks to see if the number is divisible<br>
by 2 there is no point in checking to see if it is divisible by any larger<br>
even numbers. This suggests that the values used for `test-divisor' should<br>
not be 2, 3, 4, 5, 6, &#x2026;, but rather 2, 3, 5, 7, 9, &#x2026;. To implement this<br>
change, define a procedure `next' that returns 3 if its input is equal to 2<br>
and otherwise returns its input plus 2. Modify the `smallest-divisor'<br>
procedure to use `(next test-divisor)' instead of `(+ test-divisor 1)'.<br>
With `timed-prime-test' incorporating this modified version of<br>
`smallest-divisor', run the test for each of the 12 primes found Note in 1.22<br>
Since this modification halves the number of test steps, you should expect<br>
it to run about twice as fast. Is this expectation confirmed? If not, what<br>
is the observed ratio of the speeds of the two algorithms, and how do you<br>
explain the fact that it is different from 2?<br>
</p>
</div>

<div id="outline-container-orgceb6a0b" class="outline-4">
<h4 id="orgceb6a0b">Answer</h4>
<div class="outline-text-4" id="text-orgceb6a0b">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.23/next</span> n<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>= n <span style="color: #6c71c4;">2</span><span style="color: #268bd2;">)</span> <span style="color: #6c71c4;">3</span> <span style="color: #268bd2;">(</span>+ n <span style="color: #6c71c4;">2</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga1068b7" class="outline-3">
<h3 id="orga1068b7">1.24</h3>
<div class="outline-text-3" id="text-orga1068b7">
</div>
<div id="outline-container-org2c4a385" class="outline-4">
<h4 id="org2c4a385">Answer</h4>
</div>
</div>
<div id="outline-container-orge02cf74" class="outline-3">
<h3 id="orge02cf74">1.25</h3>
<div class="outline-text-3" id="text-orge02cf74">
<p class="verse">
Alyssa P. Hacker complains that we went to a lot of extra work in writing<br>
`expmod'. After all, she says, since we already know how to compute<br>
exponentials, we could have simply written<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (expmod base exp m)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(remainder (fast-expt base exp) m))<br>
<br>
Is she correct? Would this procedure serve as well for our fast prime<br>
tester? Explain.<br>
</p>
</div>

<div id="outline-container-orgf47ba51" class="outline-4">
<h4 id="orgf47ba51">Answer</h4>
<div class="outline-text-4" id="text-orgf47ba51">
<blockquote>
<p>
Depending on the behavior of large values of `base' and `exp' combined with
the system's handling of large numbers, it is either a middling gain or an
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgdbe2f1e" class="outline-3">
<h3 id="orgdbe2f1e">1.26</h3>
<div class="outline-text-3" id="text-orgdbe2f1e">
<p class="verse">
Louis Reasoner is having great difficulty doing *Note Exercise 1.24. His<br>
`fast-prime?' test seems to run more slowly than his `prime?' test. Louis<br>
calls his friend Eva Lu Ator over to help. When they examine Louis's code,<br>
they find that he has rewritten the `expmod' procedure to use an explicit<br>
multiplication, rather than calling `square':<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (expmod base exp m)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(cond ((= exp 0) 1)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;((even? exp)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(remainder (* (expmod base (/ exp 2) m)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(expmod base (/ exp 2) m))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;m))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(else<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(remainder (* base (expmod base (- exp 1) m))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;m))))<br>
<br>
"I don't see what difference that could make," says Louis. "I do."<br>
says Eva. "By writing the procedure like that, you have transformed the<br>
[theta](`log' n) process into a [theta](n) process." Explain.<br>
</p>
</div>

<div id="outline-container-org4c66f00" class="outline-4">
<h4 id="org4c66f00">Answer</h4>
<div class="outline-text-4" id="text-org4c66f00">
<blockquote>
<p>
Assuming the computer doesn't perform any sort of sophisticated
memoization, effectively each step is performing twice as much work for n
steps, e.g n<sup>2</sup>, trimming the speed of the original implementation down to
</p>
</blockquote>
</div>
</div>
</div>
