org/_posts/2019-04-07-sicp-chapter-1.org
** 1.30
#+BEGIN_VERSE
The sum procedure above generates a linear recursion. The procedure can be
rewritten so that the sum is performed iteratively. 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.30/sum term a next b)
  (define (iter a result)
    (if (> a b)
        result
        (iter (next a) (+ (term a) result))))

  (iter a 0))

#+END_SRC
** 1.31
#+BEGIN_VERSE
1. The `sum' procedure is only the simplest of a vast number of similar
abstractions that can be captured as higher-order procedures. Write an
analogous procedure called product that returns the product of the values
of a function at points over a given range. Show how to define factorial in
terms of product. Also use product to compute approximations to π using the
formula:

    π/4 = 2/3 ⋅ 4/3 ⋅ 4/5 ⋅ 6/5 ⋅ 6/7 ⋅ 8/7

2. If your product procedure generates a recursive process, write one that
generates an iterative process. If it generates an iterative process, write
one that generates a recursive process. 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (recursive-product term a next b)
  (if (> a b) a)
  (* (term a)
     (recursive-product term (next a) next b)))

(define (iterative-product term a next b)
  (define (iter a result)
    (if (> a b)
        result
        (iter (next a) (* (term a) result))))

  (iter a 0))

(define (1.31/factorial n)
  (if (zero? n) 1
      (iterative-product identity 1 inc n)))

(define (1.31/pi-approximate n)
  (define (fnth nth)
    (if (even? nth)
        (/ (double nth) (inc (double nth)))
        (/ (inc (double nth)) (double nth))))

  (* 4.0 (iterative-product fnth 0 inc n)))

#+END_SRC
** 1.32
#+BEGIN_VERSE
1. Show that sum and product (Exercise 1.31) are both special cases of a still
more general notion called accumulate that combines a collection of terms,
using some general accumulation function:

      (accumulate
          combiner null-value term a next b)

Accumulate takes as arguments the same term and range specifications as sum
and product, together with a combiner procedure (of two arguments) that
specifies how the current term is to be combined with the accumulation of
the preceding terms and a null-value that specifies what base value to use
when the terms run out. Write accumulate and show how sum and product can
both be defined as simple calls to accumulate.

2. If your accumulate procedure generates a recursive process, write one
that generates an iterative process. If it generates an iterative process,
write one that generates a recursive process. 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.32/recursive-accumulate combiner null term a next b)
  (if (> a b) a
      (combiner (term a)
                (1.32/recursive-accumulate combiner null term (next a) next b))))

(define (1.32/iterative-accumulate combiner null term a next b)
  (define (fold-left n acc)
    (if (> n b) acc
        (fold-left (next n) (combiner (term n) acc))))
  (fold-left a null))

;; XXX: add to test
;; (1.32/iterative-accumulate * 1 identity 1 inc 5) => 120

#+END_SRC
