_posts/2019-04-07-sicp-chapter-1.html
<div id="outline-container-orgb2c7a9d" class="outline-3">
<h3 id="orgb2c7a9d">1.27</h3>
<div class="outline-text-3" id="text-orgb2c7a9d">
</div>
<div id="outline-container-org8fb539f" class="outline-4">
<h4 id="org8fb539f">Answer</h4>
</div>
</div>
<div id="outline-container-org08785c9" class="outline-3">
<h3 id="org08785c9">1.28</h3>
<div class="outline-text-3" id="text-org08785c9">
</div>
<div id="outline-container-org6a5919a" class="outline-4">
<h4 id="org6a5919a">Answer</h4>
</div>
</div>
<div id="outline-container-org3d0aa43" class="outline-3">
<h3 id="org3d0aa43">1.30</h3>
<div class="outline-text-3" id="text-org3d0aa43">
<p class="verse">
The sum procedure above generates a linear recursion. The procedure can be<br>
rewritten so that the sum is performed iteratively.<br>
</p>
</div>

<div id="outline-container-orgecc4516" class="outline-4">
<h4 id="orgecc4516">Answer</h4>
<div class="outline-text-4" id="text-orgecc4516">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.30/sum</span> term a next b<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">iter</span> a result<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>&gt; a b<span style="color: #6c71c4;">)</span>
        result
        <span style="color: #6c71c4;">(</span>iter <span style="color: #859900;">(</span>next a<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>+ <span style="color: #b58900;">(</span>term a<span style="color: #b58900;">)</span> result<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span>iter a <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9dc066a" class="outline-3">
<h3 id="org9dc066a">1.31</h3>
<div class="outline-text-3" id="text-org9dc066a">
<p class="verse">
1. The `sum' procedure is only the simplest of a vast number of similar<br>
abstractions that can be captured as higher-order procedures. Write an<br>
analogous procedure called product that returns the product of the values<br>
of a function at points over a given range. Show how to define factorial in<br>
terms of product. Also use product to compute approximations to π using the<br>
formula:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;π/4 = 2/3 ⋅ 4/3 ⋅ 4/5 ⋅ 6/5 ⋅ 6/7 ⋅ 8/7<br>
<br>
2. If your product procedure generates a recursive process, write one that<br>
generates an iterative process. If it generates an iterative process, write<br>
one that generates a recursive process.<br>
</p>
</div>

<div id="outline-container-org03b4ee1" class="outline-4">
<h4 id="org03b4ee1">Answer</h4>
<div class="outline-text-4" id="text-org03b4ee1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">recursive-product</span> term a next b<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>&gt; a b<span style="color: #268bd2;">)</span> a<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>* <span style="color: #268bd2;">(</span>term a<span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span>recursive-product term <span style="color: #6c71c4;">(</span>next a<span style="color: #6c71c4;">)</span> next b<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">iterative-product</span> term a next b<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">iter</span> a result<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>&gt; a b<span style="color: #6c71c4;">)</span>
        result
        <span style="color: #6c71c4;">(</span>iter <span style="color: #859900;">(</span>next a<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>* <span style="color: #b58900;">(</span>term a<span style="color: #b58900;">)</span> result<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span>iter a <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.31/factorial</span> n<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>zero? n<span style="color: #268bd2;">)</span> <span style="color: #6c71c4;">1</span>
      <span style="color: #268bd2;">(</span>iterative-product identity <span style="color: #6c71c4;">1</span> inc n<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.31/pi-approximate</span> n<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">fnth</span> nth<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>even? nth<span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>/ <span style="color: #859900;">(</span>double nth<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>inc <span style="color: #b58900;">(</span>double nth<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>/ <span style="color: #859900;">(</span>inc <span style="color: #b58900;">(</span>double nth<span style="color: #b58900;">)</span><span style="color: #859900;">)</span> <span style="color: #859900;">(</span>double nth<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span>* <span style="color: #6c71c4;">4.0</span> <span style="color: #268bd2;">(</span>iterative-product fnth <span style="color: #6c71c4;">0</span> inc n<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf9f42eb" class="outline-3">
<h3 id="orgf9f42eb">1.32</h3>
<div class="outline-text-3" id="text-orgf9f42eb">
<p class="verse">
1. Show that sum and product (Exercise 1.31) are both special cases of a still<br>
more general notion called accumulate that combines a collection of terms,<br>
using some general accumulation function:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(accumulate<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;combiner null-value term a next b)<br>
<br>
Accumulate takes as arguments the same term and range specifications as sum<br>
and product, together with a combiner procedure (of two arguments) that<br>
specifies how the current term is to be combined with the accumulation of<br>
the preceding terms and a null-value that specifies what base value to use<br>
when the terms run out. Write accumulate and show how sum and product can<br>
both be defined as simple calls to accumulate.<br>
<br>
2. If your accumulate procedure generates a recursive process, write one<br>
that generates an iterative process. If it generates an iterative process,<br>
write one that generates a recursive process.<br>
</p>
</div>

<div id="outline-container-org83e77e3" class="outline-4">
<h4 id="org83e77e3">Answer</h4>
<div class="outline-text-4" id="text-org83e77e3">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.32/recursive-accumulate</span> combiner null term a next b<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>&gt; a b<span style="color: #268bd2;">)</span> a
      <span style="color: #268bd2;">(</span>combiner <span style="color: #6c71c4;">(</span>term a<span style="color: #6c71c4;">)</span>
                <span style="color: #6c71c4;">(</span>1.32/recursive-accumulate combiner null term <span style="color: #859900;">(</span>next a<span style="color: #859900;">)</span> next b<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.32/iterative-accumulate</span> combiner null term a next b<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">fold-left</span> n acc<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>&gt; n b<span style="color: #6c71c4;">)</span> acc
        <span style="color: #6c71c4;">(</span>fold-left <span style="color: #859900;">(</span>next n<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>combiner <span style="color: #b58900;">(</span>term n<span style="color: #b58900;">)</span> acc<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>fold-left a null<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #cc9393;">XXX</span><span style="color: #93a1a1;">: add to test</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">(1.32/iterative-accumulate * 1 identity 1 inc 5) =&gt; 120</span>

</pre>
</div>
</div>
</div>
</div>
