org/_posts/2019-04-07-sicp-chapter-1.org
** 1.33
#+BEGIN_VERSE
You can obtain an even more general version of accumulate (Exercise 1.32)
by introducing the notion of a filter on the terms to be combined. That is,
combine only those terms derived from values in the range that satisfy a
specified condition. The resulting `filtered-accumulate' abstraction takes
the same arguments as `accumulate', together with an additional predicate of
one argument that specifies the filter. Write `filtered-accumulate' as a
procedure. Show how to express the following using `filtered-accumulate':

1. the sum of the squares of the prime numbers in the interval a to b
(assuming that you have a prime? predicate already written)

2. the product of all the positive integers less than n that are relatively
prime to n (i.e., all positive integers i < n such that GCD (i, n) = 1). 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.33/filtered-accumulate combiner null term a next b filter)
  (if (> a b) null
      (if (filter a)
          (combiner (term a)
                    (1.33/filtered-accumulate combiner null term (next a) next b filter))
          (1.33/filtered-accumulate combiner null term (next a) next b filter))))

(define (1.33/sum-of-prime-squares a b)
  (1.33/filtered-accumulate + 0 square a inc b prime?))

(define (1.33/coprimes n)
  (1.33/filtered-accumulate * 1 identity 1 inc n (λ (i) (= 1 (gcd i n)))))

#+END_SRC
** 1.34
#+BEGIN_VERSE
Suppose we define the procedure

        (define (f g) (g 2))

Then we have

        (f square)
        4

        (f (lambda (z) (* z (+ z 1))))
        6

What happens if we (perversely) ask the interpreter to evaluate the
combination (f f)?

Explain. 
#+END_VERSE

*** Answer
#+BEGIN_VERSE

#+END_VERSE
** 1.35
#+BEGIN_VERSE
Show that the golden ratio φ (1.2.2) is a fixed point of the transformation
x↦1+1/x, and use this fact to compute φ by means of the fixed-point
procedure. 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.35/find-golden-ratio)
  (fixed-point (λ (n) (+ 1 (/ 1 n))) 1))

#+END_SRC
** 1.36

*** Answer
** 1.37
#+BEGIN_VERSE
a. An infinite "continued fraction" is an expression of the form

                  N_1
        f = ---------------------
                      N_2
            D_1 + ---------------
                          N_3
                  D_2 + ---------
                        D_3 + ...

  As an quote, one can show that the infinite continued
  fraction expansion with the Nᵢ and the Dᵢ all equal to 1
  produces 1/φ, where φ is the golden ratio (described
  in section *Note 1.2.2).  One way to approximate an
  infinite continued fraction is to truncate the expansion
  after a given number of terms.  Such a truncation--a
  so-called finite continued fraction "k-term finite continued
  fraction"--has the form

              N_1
        -----------------
                  N_2
        D_1 + -----------
              ...    N_K
                  + -----
                    D_K

  Suppose that `n' and `d' are procedures of one argument (the
  term index i) that return the Nᵢ and Dᵢ of the terms of the
  continued fraction.  Define a procedure `cont-frac' such that
  evaluating `(cont-frac n d k)' computes the value of the
  k-term finite continued fraction.  Check your procedure by
  approximating 1/φ using

        (cont-frac (lambda (i) 1.0)
                  (lambda (i) 1.0)
                  k)

  for successive values of `k'.  How large must you make `k' in
  order to get an approximation that is accurate to 4 decimal
  places?

b. If your `cont-frac' procedure generates a recursive process,
  write one that generates an iterative process.  If it
  generates an iterative process, write one that generates a
  recursive process. 
#+END_VERSE

