_posts/2019-04-07-sicp-chapter-1.html
<div id="outline-container-org2dc6a14" class="outline-3">
<h3 id="org2dc6a14">1.33</h3>
<div class="outline-text-3" id="text-org2dc6a14">
<p class="verse">
You can obtain an even more general version of accumulate (Exercise 1.32)<br>
by introducing the notion of a filter on the terms to be combined. That is,<br>
combine only those terms derived from values in the range that satisfy a<br>
specified condition. The resulting `filtered-accumulate' abstraction takes<br>
the same arguments as `accumulate', together with an additional predicate of<br>
one argument that specifies the filter. Write `filtered-accumulate' as a<br>
procedure. Show how to express the following using `filtered-accumulate':<br>
<br>
1. the sum of the squares of the prime numbers in the interval a to b<br>
(assuming that you have a prime? predicate already written)<br>
<br>
2. the product of all the positive integers less than n that are relatively<br>
prime to n (i.e., all positive integers i &lt; n such that GCD (i, n) = 1).<br>
</p>
</div>

<div id="outline-container-orgf391033" class="outline-4">
<h4 id="orgf391033">Answer</h4>
<div class="outline-text-4" id="text-orgf391033">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.33/filtered-accumulate</span> combiner null term a next b filter<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>&gt; a b<span style="color: #268bd2;">)</span> null
      <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>filter a<span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span>combiner <span style="color: #859900;">(</span>term a<span style="color: #859900;">)</span>
                    <span style="color: #859900;">(</span>1.33/filtered-accumulate combiner null term <span style="color: #b58900;">(</span>next a<span style="color: #b58900;">)</span> next b filter<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span>1.33/filtered-accumulate combiner null term <span style="color: #859900;">(</span>next a<span style="color: #859900;">)</span> next b filter<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.33/sum-of-prime-squares</span> a b<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>1.33/filtered-accumulate + <span style="color: #6c71c4;">0</span> square a inc b prime?<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.33/coprimes</span> n<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>1.33/filtered-accumulate * <span style="color: #6c71c4;">1</span> identity <span style="color: #6c71c4;">1</span> inc n <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>i<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>= <span style="color: #6c71c4;">1</span> <span style="color: #859900;">(</span>gcd i n<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org29095cf" class="outline-3">
<h3 id="org29095cf">1.34</h3>
<div class="outline-text-3" id="text-org29095cf">
<p class="verse">
Suppose we define the procedure<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(define (f g) (g 2))<br>
<br>
Then we have<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(f square)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;4<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(f (lambda (z) (* z (+ z 1))))<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;6<br>
<br>
What happens if we (perversely) ask the interpreter to evaluate the<br>
combination (f f)?<br>
<br>
Explain.<br>
</p>
</div>

<div id="outline-container-org3c5b418" class="outline-4">
<h4 id="org3c5b418">Answer</h4>
<div class="outline-text-4" id="text-org3c5b418">
<p class="verse">
<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org62bcdbd" class="outline-3">
<h3 id="org62bcdbd">1.35</h3>
<div class="outline-text-3" id="text-org62bcdbd">
<p class="verse">
Show that the golden ratio φ (1.2.2) is a fixed point of the transformation<br>
x↦1+1/x, and use this fact to compute φ by means of the fixed-point<br>
procedure.<br>
</p>
</div>

<div id="outline-container-orgda56077" class="outline-4">
<h4 id="orgda56077">Answer</h4>
<div class="outline-text-4" id="text-orgda56077">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.35/find-golden-ratio</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>fixed-point <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>n<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>+ <span style="color: #6c71c4;">1</span> <span style="color: #859900;">(</span>/ <span style="color: #6c71c4;">1</span> n<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span> <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge8db704" class="outline-3">
<h3 id="orge8db704">1.36</h3>
<div class="outline-text-3" id="text-orge8db704">
</div>
<div id="outline-container-orgecf8822" class="outline-4">
<h4 id="orgecf8822">Answer</h4>
</div>
</div>
<div id="outline-container-orgcd5f630" class="outline-3">
<h3 id="orgcd5f630">1.37</h3>
<div class="outline-text-3" id="text-orgcd5f630">
<p class="verse">
a. An infinite "continued fraction" is an expression of the form<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;N<sub>1</sub><br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;f = ----------------&#x2013;&#x2014;<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;N<sub>2</sub><br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;D<sub>1</sub> + ----------&#x2013;&#x2014;<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;N<sub>3</sub><br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;D<sub>2</sub> + ----&#x2013;&#x2014;<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;D<sub>3</sub> + &#x2026;<br>
<br>
&#xa0;&#xa0;As an quote, one can show that the infinite continued<br>
&#xa0;&#xa0;fraction expansion with the Nᵢ and the Dᵢ all equal to 1<br>
&#xa0;&#xa0;produces 1/φ, where φ is the golden ratio (described<br>
&#xa0;&#xa0;in section *Note 1.2.2).  One way to approximate an<br>
&#xa0;&#xa0;infinite continued fraction is to truncate the expansion<br>
&#xa0;&#xa0;after a given number of terms.  Such a truncation&#x2013;a<br>
&#xa0;&#xa0;so-called finite continued fraction "k-term finite continued<br>
&#xa0;&#xa0;fraction"&#x2013;has the form<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;N<sub>1</sub><br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;------------&#x2013;&#x2014;<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;N<sub>2</sub><br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;D<sub>1</sub> + ------&#x2013;&#x2014;<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#x2026;    N<sub>K</sub><br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;+ &#x2013;&#x2014;<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;D<sub>K</sub><br>
<br>
&#xa0;&#xa0;Suppose that `n' and `d' are procedures of one argument (the<br>
&#xa0;&#xa0;term index i) that return the Nᵢ and Dᵢ of the terms of the<br>
&#xa0;&#xa0;continued fraction.  Define a procedure `cont-frac' such that<br>
&#xa0;&#xa0;evaluating `(cont-frac n d k)' computes the value of the<br>
&#xa0;&#xa0;k-term finite continued fraction.  Check your procedure by<br>
&#xa0;&#xa0;approximating 1/φ using<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(cont-frac (lambda (i) 1.0)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;(lambda (i) 1.0)<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;k)<br>
<br>
&#xa0;&#xa0;for successive values of `k'.  How large must you make `k' in<br>
&#xa0;&#xa0;order to get an approximation that is accurate to 4 decimal<br>
&#xa0;&#xa0;places?<br>
<br>
b. If your `cont-frac' procedure generates a recursive process,<br>
&#xa0;&#xa0;write one that generates an iterative process.  If it<br>
&#xa0;&#xa0;generates an iterative process, write one that generates a<br>
&#xa0;&#xa0;recursive process.<br>
</p>
</div>
