org/_posts/2019-04-07-sicp-chapter-1.org
*** Answer
#+BEGIN_SRC scheme
(define (1.37/cont-frac-recursive n d kth)
  (define (nth-continuation nth)
    (if (> nth kth) (d nth)
        (/ (n nth)
           (+ (d nth) (nth-continuation (inc nth))))))
  (nth-continuation 1))

(define (1.37/cont-frac-iter n d kth)
  (define (nth-continuation nth acc)
    (if (> nth kth) acc
        (nth-continuation (inc nth)
                          (/ (n nth) (+ (d nth) acc)))))
  (nth-continuation 1 0))

(define cont-frac 1.37/cont-frac-iter)
#+END_SRC
** 1.38
#+BEGIN_VERSE
In 1737, the Swiss mathematician Leonhard Euler published a memoir `De
Fractionibus Continuis', which included a continued fraction expansion for
e - 2, where e is the base of the natural logarithms. In this fraction, the
nᵢ are all 1, and the Dᵢ are successively 1, 2, 1, 1, 4, 1, 1, 6, 1, 1,
8, .... Write a program that uses your `cont-frac' procedure from Exercise
1.37 to approximate e, based on Euler's expansion. 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (e-2 k)
  (cont-frac
   (λ (i) 1.0)
   (λ (n) (if (= 0 (modulo (+ n 1) 3))
              (* 2 (/ (+ n 1) 3))
              1))
   k))

#+END_SRC
** 1.39
#+BEGIN_VERSE
A continued fraction representation of the
tangent function was published in 1770 by the German mathematician
J.H. Lambert:

x
tan x = ---------------
x^2
1 - -----------
x^2
3 - -------
5  - ...

where x is in radians.  Define a procedure `(tan-cf x k)' that
computes an approximation to the tangent function based on
Lambert's formula.  `K' specifies the number of terms to compute,
as in *Note Exercise 1.37 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.39/tan-cf x k)
  (cont-frac (λ (i) (if (= i 1) x (* -1.0 (* x x))))
             (λ (i) (- (* i 2) 1.0))
             k))

#+END_SRC
** 1.40
#+BEGIN_VERSE
Define a procedure cubic that can be used together with the newtons-method
procedure in expressions of the form

    (newtons-method (cubic a b c) 1)

to approximate zeros of the cubic x³+ax²+bx+c. 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (cubic a b c)
  (λ (x)
    (+ (* x x x)
       (* a (* x x))
       (* b x)
       c)))

#+END_SRC
** 1.41
#+BEGIN_VERSE
Define a procedure double that takes a procedure of one argument as
argument and returns a procedure that applies the original procedure twice.
For quote, if inc is a procedure that adds 1 to its argument, then
(double inc) should be a procedure that adds 2. What value is returned by

    (((double (double double)) inc) 5)

? 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.41/double fn) (λ (n) (fn (fn n))))

#+END_SRC
** 1.42
#+BEGIN_VERSE
Let f and g be two one-argument functions. The composition f after g is
defined to be the function x↦f(g(x)). Define a procedure compose that
implements composition. For quote, if inc is a procedure that adds 1 to
its argument,

    ((compose square inc) 6)
    49
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.42/compose f g) (λ (n) (f (g n))))

#+END_SRC
