_posts/2019-04-07-sicp-chapter-1.html

<div id="outline-container-org4cc0c27" class="outline-4">
<h4 id="org4cc0c27">Answer</h4>
<div class="outline-text-4" id="text-org4cc0c27">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.37/cont-frac-recursive</span> n d kth<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">nth-continuation</span> nth<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>&gt; nth kth<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>d nth<span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>/ <span style="color: #859900;">(</span>n nth<span style="color: #859900;">)</span>
           <span style="color: #859900;">(</span>+ <span style="color: #b58900;">(</span>d nth<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>nth-continuation <span style="color: #268bd2;">(</span>inc nth<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>nth-continuation <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.37/cont-frac-iter</span> n d kth<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">nth-continuation</span> nth acc<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>&gt; nth kth<span style="color: #6c71c4;">)</span> acc
        <span style="color: #6c71c4;">(</span>nth-continuation <span style="color: #859900;">(</span>inc nth<span style="color: #859900;">)</span>
                          <span style="color: #859900;">(</span>/ <span style="color: #b58900;">(</span>n nth<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>+ <span style="color: #268bd2;">(</span>d nth<span style="color: #268bd2;">)</span> acc<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>nth-continuation <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">cont-frac</span> 1.37/cont-frac-iter<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org163dec8" class="outline-3">
<h3 id="org163dec8">1.38</h3>
<div class="outline-text-3" id="text-org163dec8">
<p class="verse">
In 1737, the Swiss mathematician Leonhard Euler published a memoir `De<br>
Fractionibus Continuis', which included a continued fraction expansion for<br>
e - 2, where e is the base of the natural logarithms. In this fraction, the<br>
nᵢ are all 1, and the Dᵢ are successively 1, 2, 1, 1, 4, 1, 1, 6, 1, 1,<br>
8, &#x2026;. Write a program that uses your `cont-frac' procedure from Exercise<br>
1.37 to approximate e, based on Euler's expansion.<br>
</p>
</div>

<div id="outline-container-org2015806" class="outline-4">
<h4 id="org2015806">Answer</h4>
<div class="outline-text-4" id="text-org2015806">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">e-2</span> k<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>cont-frac
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>i<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">1.0</span><span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>n<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>= <span style="color: #6c71c4;">0</span> <span style="color: #b58900;">(</span>modulo <span style="color: #268bd2;">(</span>+ n <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span> <span style="color: #6c71c4;">3</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
              <span style="color: #859900;">(</span>* <span style="color: #6c71c4;">2</span> <span style="color: #b58900;">(</span>/ <span style="color: #268bd2;">(</span>+ n <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span> <span style="color: #6c71c4;">3</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
              <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
   k<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org06394c4" class="outline-3">
<h3 id="org06394c4">1.39</h3>
<div class="outline-text-3" id="text-org06394c4">
<p class="verse">
A continued fraction representation of the<br>
tangent function was published in 1770 by the German mathematician<br>
J.H. Lambert:<br>
<br>
x<br>
tan x = ----------&#x2013;&#x2014;<br>
x<sup>2</sup><br>
1 - ------&#x2013;&#x2014;<br>
x<sup>2</sup><br>
3 - --&#x2013;&#x2014;<br>
5  - &#x2026;<br>
<br>
where x is in radians.  Define a procedure `(tan-cf x k)' that<br>
computes an approximation to the tangent function based on<br>
Lambert's formula.  `K' specifies the number of terms to compute,<br>
as in *Note Exercise 1.37<br>
</p>
</div>

<div id="outline-container-orgf423c11" class="outline-4">
<h4 id="orgf423c11">Answer</h4>
<div class="outline-text-4" id="text-orgf423c11">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.39/tan-cf</span> x k<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>cont-frac <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>i<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>= i <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span> x <span style="color: #859900;">(</span>* <span style="color: #6c71c4;">-1.0</span> <span style="color: #b58900;">(</span>* x x<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
             <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>i<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>- <span style="color: #859900;">(</span>* i <span style="color: #6c71c4;">2</span><span style="color: #859900;">)</span> <span style="color: #6c71c4;">1.0</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
             k<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4c838f0" class="outline-3">
<h3 id="org4c838f0">1.40</h3>
<div class="outline-text-3" id="text-org4c838f0">
<p class="verse">
Define a procedure cubic that can be used together with the newtons-method<br>
procedure in expressions of the form<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;(newtons-method (cubic a b c) 1)<br>
<br>
to approximate zeros of the cubic x³+ax²+bx+c.<br>
</p>
</div>

<div id="outline-container-org81e57cc" class="outline-4">
<h4 id="org81e57cc">Answer</h4>
<div class="outline-text-4" id="text-org81e57cc">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">cubic</span> a b c<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #268bd2;">(</span>x<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>+ <span style="color: #6c71c4;">(</span>* x x x<span style="color: #6c71c4;">)</span>
       <span style="color: #6c71c4;">(</span>* a <span style="color: #859900;">(</span>* x x<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
       <span style="color: #6c71c4;">(</span>* b x<span style="color: #6c71c4;">)</span>
       c<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6c75317" class="outline-3">
<h3 id="org6c75317">1.41</h3>
<div class="outline-text-3" id="text-org6c75317">
<p class="verse">
Define a procedure double that takes a procedure of one argument as<br>
argument and returns a procedure that applies the original procedure twice.<br>
For quote, if inc is a procedure that adds 1 to its argument, then<br>
(double inc) should be a procedure that adds 2. What value is returned by<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;(((double (double double)) inc) 5)<br>
<br>
?<br>
</p>
</div>

<div id="outline-container-org63adab4" class="outline-4">
<h4 id="org63adab4">Answer</h4>
<div class="outline-text-4" id="text-org63adab4">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.41/double</span> fn<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #268bd2;">(</span>n<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>fn <span style="color: #6c71c4;">(</span>fn n<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge79b8d2" class="outline-3">
<h3 id="orge79b8d2">1.42</h3>
<div class="outline-text-3" id="text-orge79b8d2">
<p class="verse">
Let f and g be two one-argument functions. The composition f after g is<br>
defined to be the function x↦f(g(x)). Define a procedure compose that<br>
implements composition. For quote, if inc is a procedure that adds 1 to<br>
its argument,<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;((compose square inc) 6)<br>
&#xa0;&#xa0;&#xa0;&#xa0;49<br>
</p>
</div>

<div id="outline-container-org2fbca79" class="outline-4">
<h4 id="org2fbca79">Answer</h4>
<div class="outline-text-4" id="text-org2fbca79">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.42/compose</span> f g<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #268bd2;">(</span>n<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>f <span style="color: #6c71c4;">(</span>g n<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
