org/_posts/2019-04-07-sicp-chapter-1.org
** 1.43
#+BEGIN_VERSE
If f is a numerical function and n is a positive integer, then we can form
the nth repeated application of f, which is defined to be the function
whose value at x is f(f(…(f(x))…)). For quote, if f is the function
x↦x+1, then the nth repeated application of f is the function x↦x+n. If f
is the operation of squaring a number, then the nth repeated application of
f is the function that raises its argument to the 2n-th power. Write a
procedure that takes as inputs a procedure that computes f and a positive
integer n and returns the procedure that computes the nth repeated
application of f. Your procedure should be able to be used as follows:

    ((repeated square 2) 5)
    625

Hint: You may find it convenient to use compose from Exercise 1.42. 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.43/repeated-apply fn times)
  (if (= times 1) (λ (n) (fn n))
      (λ (n)
        (fn
         ((1.43/repeated-apply fn (- times 1)) n)))))

#+END_SRC
** 1.44
#+BEGIN_VERSE
The idea of smoothing a function is an important concept in signal
processing. If f is a function and dx is some small number, then the
smoothed version of f is the function whose value at a point x is the
average of f(x−dx), f(x), and f(x+dx). Write a procedure smooth that takes
as input a procedure that computes f and returns a procedure that computes
the smoothed f. It is sometimes valuable to repeatedly smooth a function
(that is, smooth the smoothed function, and so on) to obtain the n-fold
smoothed function. Show how to generate the n-fold smoothed function of any
given function using smooth and repeated from Exercise 1.43. 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (1.44/smooth f)
  (λ (x)
    (/ (+ (f (- x dx))
          (f x)
          (f (+ x dx)))
       3)))

#+END_SRC
** 1.45

*** Answer
** 1.46
#+BEGIN_VERSE
Several of the numerical methods described in this chapter are instances of
an extremely general computational strategy known as iterative improvement.
Iterative improvement says that, to compute something, we start with an
initial guess for the answer, test if the guess is good enough, and
otherwise improve the guess and continue the process using the improved
guess as the new guess. Write a procedure iterative-improve that takes two
procedures as arguments: a method for telling whether a guess is good
enough and a method for improving a guess. Iterative-improve should return
as its value a procedure that takes a guess as argument and keeps improving
the guess until it is good enough. Rewrite the sqrt procedure of 1.1.7 and
the fixed-point procedure of 1.3.3 in terms of iterative-improve. 
#+END_VERSE

*** Answer
#+BEGIN_SRC scheme
(define (iterative-improve good-enough? improve)
  (λ (guess)
    (let ([improved (improve guess)])
      (if (good-enough? guess improved) guess
          ((iterative-improve good-enough? improve) improved)))))

(define (1.46/iterative-sqrt n)
  (iterative-improve
   (λ (guess improved) (< (abs (- guess improved)) 0.001))
   (λ (guess)
     (average guess (/ n guess)))))

(define (1.46/fixed-point f first-guess)
  ((iterative-improve
    (λ (guess)
      (< (abs (- (f guess) guess))
         0.00001))
    (λ (guess) (f guess)))
   first-guess))

#+END_SRC
