_posts/2019-04-07-sicp-chapter-1.html
<div id="outline-container-org5e6557b" class="outline-3">
<h3 id="org5e6557b">1.43</h3>
<div class="outline-text-3" id="text-org5e6557b">
<p class="verse">
If f is a numerical function and n is a positive integer, then we can form<br>
the nth repeated application of f, which is defined to be the function<br>
whose value at x is f(f(…(f(x))…)). For quote, if f is the function<br>
x↦x+1, then the nth repeated application of f is the function x↦x+n. If f<br>
is the operation of squaring a number, then the nth repeated application of<br>
f is the function that raises its argument to the 2n-th power. Write a<br>
procedure that takes as inputs a procedure that computes f and a positive<br>
integer n and returns the procedure that computes the nth repeated<br>
application of f. Your procedure should be able to be used as follows:<br>
<br>
&#xa0;&#xa0;&#xa0;&#xa0;((repeated square 2) 5)<br>
&#xa0;&#xa0;&#xa0;&#xa0;625<br>
<br>
Hint: You may find it convenient to use compose from Exercise 1.42.<br>
</p>
</div>

<div id="outline-container-orge0659f8" class="outline-4">
<h4 id="orge0659f8">Answer</h4>
<div class="outline-text-4" id="text-orge0659f8">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.43/repeated-apply</span> fn times<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>= times <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>n<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>fn n<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>n<span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>fn
         <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>1.43/repeated-apply fn <span style="color: #268bd2;">(</span>- times <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> n<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb04ad84" class="outline-3">
<h3 id="orgb04ad84">1.44</h3>
<div class="outline-text-3" id="text-orgb04ad84">
<p class="verse">
The idea of smoothing a function is an important concept in signal<br>
processing. If f is a function and dx is some small number, then the<br>
smoothed version of f is the function whose value at a point x is the<br>
average of f(x−dx), f(x), and f(x+dx). Write a procedure smooth that takes<br>
as input a procedure that computes f and returns a procedure that computes<br>
the smoothed f. It is sometimes valuable to repeatedly smooth a function<br>
(that is, smooth the smoothed function, and so on) to obtain the n-fold<br>
smoothed function. Show how to generate the n-fold smoothed function of any<br>
given function using smooth and repeated from Exercise 1.43.<br>
</p>
</div>

<div id="outline-container-orgcfa7a7b" class="outline-4">
<h4 id="orgcfa7a7b">Answer</h4>
<div class="outline-text-4" id="text-orgcfa7a7b">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.44/smooth</span> f<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #268bd2;">(</span>x<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>/ <span style="color: #6c71c4;">(</span>+ <span style="color: #859900;">(</span>f <span style="color: #b58900;">(</span>- x dx<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>f x<span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>f <span style="color: #b58900;">(</span>+ x dx<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
       <span style="color: #6c71c4;">3</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org238e0d9" class="outline-3">
<h3 id="org238e0d9">1.45</h3>
<div class="outline-text-3" id="text-org238e0d9">
</div>
<div id="outline-container-org55db118" class="outline-4">
<h4 id="org55db118">Answer</h4>
</div>
</div>
<div id="outline-container-org28913c3" class="outline-3">
<h3 id="org28913c3">1.46</h3>
<div class="outline-text-3" id="text-org28913c3">
<p class="verse">
Several of the numerical methods described in this chapter are instances of<br>
an extremely general computational strategy known as iterative improvement.<br>
Iterative improvement says that, to compute something, we start with an<br>
initial guess for the answer, test if the guess is good enough, and<br>
otherwise improve the guess and continue the process using the improved<br>
guess as the new guess. Write a procedure iterative-improve that takes two<br>
procedures as arguments: a method for telling whether a guess is good<br>
enough and a method for improving a guess. Iterative-improve should return<br>
as its value a procedure that takes a guess as argument and keeps improving<br>
the guess until it is good enough. Rewrite the sqrt procedure of 1.1.7 and<br>
the fixed-point procedure of 1.3.3 in terms of iterative-improve.<br>
</p>
</div>

<div id="outline-container-orge68d787" class="outline-4">
<h4 id="orge68d787">Answer</h4>
<div class="outline-text-4" id="text-orge68d787">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">iterative-improve</span> good-enough? improve<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #268bd2;">(</span>guess<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">[</span>improved <span style="color: #b58900;">(</span>improve guess<span style="color: #b58900;">)</span><span style="color: #859900;">]</span><span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>good-enough? guess improved<span style="color: #859900;">)</span> guess
          <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>iterative-improve good-enough? improve<span style="color: #b58900;">)</span> improved<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.46/iterative-sqrt</span> n<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>iterative-improve
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>guess improved<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>&lt; <span style="color: #859900;">(</span>abs <span style="color: #b58900;">(</span>- guess improved<span style="color: #b58900;">)</span><span style="color: #859900;">)</span> <span style="color: #6c71c4;">0.001</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>guess<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>average guess <span style="color: #859900;">(</span>/ n guess<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">1.46/fixed-point</span> f first-guess<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>iterative-improve
    <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>guess<span style="color: #859900;">)</span>
      <span style="color: #859900;">(</span>&lt; <span style="color: #b58900;">(</span>abs <span style="color: #268bd2;">(</span>- <span style="color: #6c71c4;">(</span>f guess<span style="color: #6c71c4;">)</span> guess<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
         <span style="color: #6c71c4;">0.00001</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
    <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>guess<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>f guess<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
   first-guess<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
</section>
